{
    "number": 54,
    "name": "القَمَرِ",
    "transliteration": "Al-Qamar",
    "translation": "The Moon",
    "revelation_type": "Meccan",
    "total_verses": 55,
    "verses": [
        {
            "Verses": 1,
            "text": "The Hour has come near, and the moon has split [in two]."
        },
        {
            "Verses": 2,
            "text": "And if they see a miracle, they turn away and say, \"Passing magic.\""
        },
        {
            "Verses": 3,
            "text": "And they denied and followed their inclinations. But for every matter is a [time of] settlement."
        },
        {
            "Verses": 4,
            "text": "And there has already come to them of information that in which there is deterrence -"
        },
        {
            "Verses": 5,
            "text": "Extensive wisdom - but warning does not avail [them]."
        },
        {
            "Verses": 6,
            "text": "So leave them, [O Muhammad]. The Day the Caller calls to something forbidding,"
        },
        {
            "Verses": 7,
            "text": "Their eyes humbled, they will emerge from the graves as if they were locusts spreading,"
        },
        {
            "Verses": 8,
            "text": "Racing ahead toward the Caller. The disbelievers will say, \"This is a difficult Day.\""
        },
        {
            "Verses": 9,
            "text": "The people of Noah denied before them, and they denied Our servant and said, \"A madman,\" and he was repelled."
        },
        {
            "Verses": 10,
            "text": "So he invoked his Lord, \"Indeed, I am overpowered, so help.\""
        },
        {
            "Verses": 11,
            "text": "Then We opened the gates of the heaven with rain pouring down"
        },
        {
            "Verses": 12,
            "text": "And caused the earth to burst with springs, and the waters met for a matter already predestined."
        },
        {
            "Verses": 13,
            "text": "And We carried him on a [construction of] planks and nails,"
        },
        {
            "Verses": 14,
            "text": "Sailing under Our observation as reward for he who had been denied."
        },
        {
            "Verses": 15,
            "text": "And We left it as a sign, so is there any who will remember?"
        },
        {
            "Verses": 16,
            "text": "And how [severe] were My punishment and warning."
        },
        {
            "Verses": 17,
            "text": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
        },
        {
            "Verses": 18,
            "text": "'Aad denied; and how [severe] were My punishment and warning."
        },
        {
            "Verses": 19,
            "text": "Indeed, We sent upon them a screaming wind on a day of continuous misfortune,"
        },
        {
            "Verses": 20,
            "text": "Extracting the people as if they were trunks of palm trees uprooted."
        },
        {
            "Verses": 21,
            "text": "And how [severe] were My punishment and warning."
        },
        {
            "Verses": 22,
            "text": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
        },
        {
            "Verses": 23,
            "text": "Thamud denied the warning"
        },
        {
            "Verses": 24,
            "text": "And said, \"Is it one human being among us that we should follow? Indeed, we would then be in error and madness."
        },
        {
            "Verses": 25,
            "text": "Has the message been sent down upon him from among us? Rather, he is an insolent liar.\""
        },
        {
            "Verses": 26,
            "text": "They will know tomorrow who is the insolent liar."
        },
        {
            "Verses": 27,
            "text": "Indeed, We are sending the she-camel as trial for them, so watch them and be patient."
        },
        {
            "Verses": 28,
            "text": "And inform them that the water is shared between them, each [day of] drink attended [by turn]."
        },
        {
            "Verses": 29,
            "text": "But they called their companion, and he dared and hamstrung [her]."
        },
        {
            "Verses": 30,
            "text": "And how [severe] were My punishment and warning."
        },
        {
            "Verses": 31,
            "text": "Indeed, We sent upon them one blast from the sky, and they became like the dry twig fragments of an [animal] pen."
        },
        {
            "Verses": 32,
            "text": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
        },
        {
            "Verses": 33,
            "text": "The people of Lot denied the warning."
        },
        {
            "Verses": 34,
            "text": "Indeed, We sent upon them a storm of stones, except the family of Lot - We saved them before dawn"
        },
        {
            "Verses": 35,
            "text": "As favor from us. Thus do We reward he who is grateful."
        },
        {
            "Verses": 36,
            "text": "And he had already warned them of Our assault, but they disputed the warning."
        },
        {
            "Verses": 37,
            "text": "And they had demanded from him his guests, but We obliterated their eyes, [saying], \"Taste My punishment and warning.\""
        },
        {
            "Verses": 38,
            "text": "And there came upon them by morning an abiding punishment."
        },
        {
            "Verses": 39,
            "text": "So taste My punishment and warning."
        },
        {
            "Verses": 40,
            "text": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
        },
        {
            "Verses": 41,
            "text": "And there certainly came to the people of Pharaoh warning."
        },
        {
            "Verses": 42,
            "text": "They denied Our signs, all of them, so We seized them with a seizure of one Exalted in Might and Perfect in Ability."
        },
        {
            "Verses": 43,
            "text": "Are your disbelievers better than those [former ones], or have you immunity in the scripture?"
        },
        {
            "Verses": 44,
            "text": "Or do they say, \"We are an assembly supporting [each other]\"?"
        },
        {
            "Verses": 45,
            "text": "[Their] assembly will be defeated, and they will turn their backs [in retreat]."
        },
        {
            "Verses": 46,
            "text": "But the Hour is their appointment [for due punishment], and the Hour is more disastrous and more bitter."
        },
        {
            "Verses": 47,
            "text": "Indeed, the criminals are in error and madness."
        },
        {
            "Verses": 48,
            "text": "The Day they are dragged into the Fire on their faces [it will be said], \"Taste the touch of Saqar.\""
        },
        {
            "Verses": 49,
            "text": "Indeed, all things We created with predestination."
        },
        {
            "Verses": 50,
            "text": "And Our command is but one, like a glance of the eye."
        },
        {
            "Verses": 51,
            "text": "And We have already destroyed your kinds, so is there any who will remember?"
        },
        {
            "Verses": 52,
            "text": "And everything they did is in written records."
        },
        {
            "Verses": 53,
            "text": "And every small and great [thing] is inscribed."
        },
        {
            "Verses": 54,
            "text": "Indeed, the righteous will be among gardens and rivers,"
        },
        {
            "Verses": 55,
            "text": "In a seat of honor near a Sovereign, Perfect in Ability."
        }
    ]
}
