{
    "number": 44,
    "name": "الدُّخَانِ",
    "transliteration": "আদ দোখান",
    "translation": "The Smoke",
    "revelation_type": "মাক্কি",
    "total_verses": 59,
    "verses": [
        {
            "Verses": 1,
            "text": "হা-মীম।"
        },
        {
            "Verses": 2,
            "text": "শপথ সুস্পষ্ট কিতাবের।"
        },
        {
            "Verses": 3,
            "text": "আমি একে নাযিল করেছি। এক বরকতময় রাতে, নিশ্চয় আমি সতর্ককারী।"
        },
        {
            "Verses": 4,
            "text": "এ রাতে প্রত্যেক প্রজ্ঞাপূর্ণ বিষয় স্থিরীকৃত হয়।"
        },
        {
            "Verses": 5,
            "text": "আমার পক্ষ থেকে আদেশক্রমে, আমিই প্রেরণকারী।"
        },
        {
            "Verses": 6,
            "text": "আপনার পালনকর্তার পক্ষ থেকে রহমতস্বরূপ। তিনি সর্বশ্রোতা, সর্বজ্ঞ।"
        },
        {
            "Verses": 7,
            "text": "যদি তোমাদের বিশ্বাস থাকে দেখতে পাবে। তিনি নভোমন্ডল, ভূমন্ডল ও এতদুভয়ের মধ্যেবর্তী সবকিছুর পালনকর্তা।"
        },
        {
            "Verses": 8,
            "text": "তিনি ব্যতীত কোন উপাস্য নেই। তিনি জীবন দান করেন ও মৃত্যু দেন। তিনি তোমাদের পালনকর্তা এবং তোমাদের পূর্ববর্তী পিতৃ-পুরুষদেরও পালনকর্তা।"
        },
        {
            "Verses": 9,
            "text": "এতদসত্ত্বেও এরা সন্দেহে পতিত হয়ে ক্রীড়া-কৌতুক করছে।"
        },
        {
            "Verses": 10,
            "text": "অতএব আপনি সেই দিনের অপেক্ষা করুন, যখন আকাশ ধূয়ায় ছেয়ে যাবে।"
        },
        {
            "Verses": 11,
            "text": "যা মানুষকে ঘিরে ফেলবে। এটা যন্ত্রণাদায়ক শাস্তি।"
        },
        {
            "Verses": 12,
            "text": "হে আমাদের পালনকর্তা আমাদের উপর থেকে শাস্তি প্রত্যাহার করুন, আমরা বিশ্বাস স্থাপন করছি।"
        },
        {
            "Verses": 13,
            "text": "তারা কি করে বুঝবে, অথচ তাদের কাছে এসেছিলেন স্পষ্ট বর্ণনাকারী রসূল।"
        },
        {
            "Verses": 14,
            "text": "অতঃপর তারা তাকে পৃষ্ঠপ্রদর্শন করে এবং বলে, সে তো উম্মাদ-শিখানো কথা বলে।"
        },
        {
            "Verses": 15,
            "text": "আমি তোমাদের উপর থেকে আযাব কিছুটা প্রত্যাহার করব, কিন্তু তোমরা পুনরায় পুনর্বস্থায় ফিরে যাবে।"
        },
        {
            "Verses": 16,
            "text": "যেদিন আমি প্রবলভাবে ধৃত করব, সেদিন পুরোপুরি প্রতিশোধ গ্রহণ করবই।"
        },
        {
            "Verses": 17,
            "text": "তাদের পূর্বে আমি ফেরাউনের সম্প্রদায়কে পরীক্ষা করেছি এবং তাদের কাছে আগমন করেছেন একজন সম্মানিত রসূল,"
        },
        {
            "Verses": 18,
            "text": "এই মর্মে যে, আল্লাহর বান্দাদেরকে আমার কাছে অর্পণ কর। আমি তোমাদের জন্য প্রেরীত বিশ্বস্ত রসূল।"
        },
        {
            "Verses": 19,
            "text": "আর তোমরা আল্লাহর বিরুদ্ধে ঔদ্ধত্য প্রকাশ করো না। আমি তোমাদের কাছে প্রকাশ্য প্রমাণ উপস্থিত করছি।"
        },
        {
            "Verses": 20,
            "text": "তোমরা যাতে আমাকে প্রস্তরবর্ষণে হত্যা না কর, তজ্জন্যে আমি আমার পালনকর্তা ও তোমাদের পালনকর্তার শরনাপন্ন হয়েছি।"
        },
        {
            "Verses": 21,
            "text": "তোমরা যদি আমার প্রতি বিশ্বাস স্থাপন না কর, তবে আমার কাছ থেকে দূরে থাক।"
        },
        {
            "Verses": 22,
            "text": "অতঃপর সে তার পালনকর্তার কাছে দোয়া করল যে, এরা অপরাধী সম্প্রদায়।"
        },
        {
            "Verses": 23,
            "text": "তাহলে তুমি আমার বান্দাদেরকে নিয়ে রাত্রিবেলায় বের হয়ে পড়। নিশ্চয় তোমাদের পশ্চাদ্ধবন করা হবে।"
        },
        {
            "Verses": 24,
            "text": "এবং সমুদ্রকে অচল থাকতে দাও। নিশ্চয় ওরা নিমজ্জত বাহিনী।"
        },
        {
            "Verses": 25,
            "text": "তারা ছেড়ে গিয়েছিল কত উদ্যান ও প্রস্রবন,"
        },
        {
            "Verses": 26,
            "text": "কত শস্যক্ষেত্র ও সূরম্য স্থান।"
        },
        {
            "Verses": 27,
            "text": "কত সুখের উপকরণ, যাতে তারা খোশগল্প করত।"
        },
        {
            "Verses": 28,
            "text": "এমনিই হয়েছিল এবং আমি ওগুলোর মালিক করেছিলাম ভিন্ন সম্প্রদায়কে।"
        },
        {
            "Verses": 29,
            "text": "তাদের জন্যে ক্রন্দন করেনি আকাশ ও পৃথিবী এবং তারা অবকাশও পায়নি।"
        },
        {
            "Verses": 30,
            "text": "আমি বনী-ইসরাঈলকে অপমানজনক শাস্তি থেকে উদ্ধার করছি।"
        },
        {
            "Verses": 31,
            "text": "ফেরাউন সে ছিল সীমালংঘনকারীদের মধ্যে শীর্ষস্থানীয়।"
        },
        {
            "Verses": 32,
            "text": "আমি জেনেশুনে তাদেরকে বিশ্ববাসীদের উপর শ্রেষ্ঠত্ব দিয়েছিলাম।"
        },
        {
            "Verses": 33,
            "text": "এবং আমি তাদেরকে এমন নিদর্শনাবলী দিয়েছিলাম যাতে ছিল স্পষ্ট সাহায্য।"
        },
        {
            "Verses": 34,
            "text": "কাফেররা বলেই থাকে,"
        },
        {
            "Verses": 35,
            "text": "প্রথম মৃত্যুর মাধ্যমেই আমাদের সবকিছুর অবসান হবে এবং আমরা পুনরুত্থিত হব না।"
        },
        {
            "Verses": 36,
            "text": "তোমরা যদি সত্যবাদী হও, তবে আমাদের পূর্বপুরুষদেরকে নিয়ে এস।"
        },
        {
            "Verses": 37,
            "text": "ওরা শ্রেষ্ঠ, না তুব্বার সম্প্রদায় ও তাদের পূর্ববর্তীরা? আমি ওদেরকে ধ্বংস করে দিয়েছি। ওরা ছিল অপরাধী।"
        },
        {
            "Verses": 38,
            "text": "আমি নভোমন্ডল, ভূমন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছু ক্রীড়াচ্ছলে সৃষ্টি করিনি।"
        },
        {
            "Verses": 39,
            "text": "আমি এগুলো যথাযথ উদ্দেশ্যে সৃষ্টি করেছি; কিন্তু তাদের অধিকাংশই বোঝে না।"
        },
        {
            "Verses": 40,
            "text": "নিশ্চয় ফয়সালার দিন তাদের সবারই নির্ধারিত সময়।"
        },
        {
            "Verses": 41,
            "text": "যেদিন কোন বন্ধুই কোন বন্ধুর উপকারে আসবে না এবং তারা সাহায্যপ্রাপ্তও হবে না।"
        },
        {
            "Verses": 42,
            "text": "তবে আল্লাহ যার প্রতি দয়া করেন, তার কথা ভিন্ন। নিশ্চয় তিনি পরাক্রমশালী দয়াময়।"
        },
        {
            "Verses": 43,
            "text": "নিশ্চয় যাক্কুম বৃক্ষ"
        },
        {
            "Verses": 44,
            "text": "পাপীর খাদ্য হবে;"
        },
        {
            "Verses": 45,
            "text": "গলিত তাম্রের মত পেটে ফুটতে থাকবে।"
        },
        {
            "Verses": 46,
            "text": "যেমন ফুটে পানি।"
        },
        {
            "Verses": 47,
            "text": "একে ধর এবং টেনে নিয়ে যাও জাহান্নামের মধ্যস্থলে,"
        },
        {
            "Verses": 48,
            "text": "অতঃপর তার মাথার উপর ফুটন্ত পানির আযাব ঢেলে দাও,"
        },
        {
            "Verses": 49,
            "text": "স্বাদ গ্রহণ কর, তুমি তো সম্মানিত, সম্ভ্রান্ত।"
        },
        {
            "Verses": 50,
            "text": "এ সম্পর্কে তোমরা সন্দেহে পতিত ছিলে।"
        },
        {
            "Verses": 51,
            "text": "নিশ্চয় খোদাভীরুরা নিরাপদ স্থানে থাকবে-"
        },
        {
            "Verses": 52,
            "text": "উদ্যানরাজি ও নির্ঝরিণীসমূহে।"
        },
        {
            "Verses": 53,
            "text": "তারা পরিধান করবে চিকন ও পুরু রেশমীবস্ত্র, মুখোমুখি হয়ে বসবে।"
        },
        {
            "Verses": 54,
            "text": "এরূপই হবে এবং আমি তাদেরকে আনতলোচনা স্ত্রী দেব।"
        },
        {
            "Verses": 55,
            "text": "তারা সেখানে শান্ত মনে বিভিন্ন ফল-মূল আনতে বলবে।"
        },
        {
            "Verses": 56,
            "text": "তারা সেখানে মৃত্যু আস্বাদন করবে না, প্রথম মৃত্যু ব্যতীত এবং আপনার পালনকর্তা তাদেরকে জাহান্নামের আযাব থেকে রক্ষা করবেন।"
        },
        {
            "Verses": 57,
            "text": "আপনার পালনকর্তার কৃপায় এটাই মহা সাফল্য।"
        },
        {
            "Verses": 58,
            "text": "আমি আপনার ভাষায় কোরআনকে সহজ করে দিয়েছি, যাতে তারা স্মরণ রাখে।"
        },
        {
            "Verses": 59,
            "text": "অতএব, আপনি অপেক্ষা করুন, তারাও অপেক্ষা করছে।"
        }
    ]
}
